In [1]:
import pandas as pd

In [2]:
titanic = pd.read_csv("titanic-data.csv")

In [9]:
len(titanic)

891

In [3]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
titanic.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [5]:
columns_to_drop = [
    "PassengerId", "Name", "Ticket", "Fare", "Cabin"
]

In [6]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [7]:
titanic = titanic.drop(columns_to_drop, axis=1)

In [8]:
titanic.head(6)

   Survived  Pclass     Sex   Age  SibSp  Parch Embarked
0         0       3    male  22.0      1      0        S
1         1       1  female  38.0      1      0        C
2         1       3  female  26.0      0      0        S
3         1       1  female  35.0      1      0        S
4         0       3    male  35.0      0      0        S
5         0       3    male   NaN      0      0        Q

In [10]:
titanic.describe()

         Survived      Pclass         Age       SibSp       Parch
count  891.000000  891.000000  714.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594
std      0.486592    0.836071   14.526497    1.102743    0.806057
min      0.000000    1.000000    0.420000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000
50%      0.000000    3.000000   28.000000    0.000000    0.000000
75%      1.000000    3.000000   38.000000    1.000000    0.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000

In [11]:
titanic['Age'].isnull().sum()

177

In [12]:
titanic['Age'].isnull().sum() / len(titanic)

0.19865319865319866

In [14]:
titanic[titanic['Age'].isnull()].head()

    Survived  Pclass     Sex  Age  SibSp  Parch Embarked
5          0       3    male  NaN      0      0        Q
17         1       2    male  NaN      0      0        S
19         1       3  female  NaN      0      0        C
26         0       3    male  NaN      0      0        C
28         1       3  female  NaN      0      0        Q

In [15]:
titanic[(titanic['Sex'] == 'male') & (titanic['Age'] > 0)].describe()

         Survived      Pclass         Age       SibSp       Parch
count  453.000000  453.000000  453.000000  453.000000  453.000000
mean     0.205298    2.335541   30.726645    0.439294    0.271523
std      0.404366    0.818748   14.678201    0.923609    0.651076
min      0.000000    1.000000    0.420000    0.000000    0.000000
25%      0.000000    2.000000   21.000000    0.000000    0.000000
50%      0.000000    3.000000   29.000000    0.000000    0.000000
75%      0.000000    3.000000   39.000000    1.000000    0.000000
max      1.000000    3.000000   80.000000    5.000000    5.000000

In [16]:
titanic[(titanic['Sex'] == 'female') & (titanic['Age'] > 0)].describe()

         Survived      Pclass         Age       SibSp       Parch
count  261.000000  261.000000  261.000000  261.000000  261.000000
mean     0.754789    2.065134   27.915709    0.639847    0.708812
std      0.431039    0.845560   14.110146    0.928493    1.066752
min      0.000000    1.000000    0.750000    0.000000    0.000000
25%      1.000000    1.000000   18.000000    0.000000    0.000000
50%      1.000000    2.000000   27.000000    0.000000    0.000000
75%      1.000000    3.000000   37.000000    1.000000    1.000000
max      1.000000    3.000000   63.000000    5.000000    6.000000

In [17]:
male_mean_age = round(30.726645)
female_mean_age = round(27.915709)

In [18]:
def fix_missing_ages(row):
    if pd.isnull(row['Age']):
        if row['Sex'] == 'male':
            return male_mean_age
        else:
            return female_mean_age
    else:
        return row['Age']

In [19]:
titanic['Age'] = titanic.apply(fix_missing_ages, axis=1)

In [20]:
titanic[(titanic['Age'].isnull())]

Empty DataFrame
Columns: [Survived, Pclass, Sex, Age, SibSp, Parch, Embarked]
Index: []

In [21]:
titanic.head()

   Survived  Pclass     Sex   Age  SibSp  Parch Embarked
0         0       3    male  22.0      1      0        S
1         1       1  female  38.0      1      0        C
2         1       3  female  26.0      0      0        S
3         1       1  female  35.0      1      0        S
4         0       3    male  35.0      0      0        S

In [23]:
titanic[titanic['Embarked'].isnull()]

     Survived  Pclass     Sex   Age  SibSp  Parch Embarked
61          1       1  female  38.0      0      0      NaN
829         1       1  female  62.0      0      0      NaN

In [24]:
embarked_classes = titanic['Embarked'].unique()

In [25]:
for ec in embarked_classes:
    print(ec, len(titanic[titanic['Embarked'] == ec]))

S 644
C 168
Q 77
nan 0

In [27]:
titanic = titanic.drop(["Embarked"], axis=1)

In [28]:
titanic.head()

   Survived  Pclass     Sex   Age  SibSp  Parch
0         0       3    male  22.0      1      0
1         1       1  female  38.0      1      0
2         1       3  female  26.0      0      0
3         1       1  female  35.0      1      0
4         0       3    male  35.0      0      0

In [31]:
titanic.groupby(['Sex','Pclass'])['Age'].mean()

Sex     Pclass
female  1         33.978723
        2         28.703947
        3         23.572917
male    1         39.511639
        2         30.762315
        3         27.724553
Name: Age, dtype: float64

In [32]:
titanic['family'] = titanic['SibSp'] + titanic['Parch']

In [33]:
titanic.head()

   Survived  Pclass     Sex   Age  SibSp  Parch  family
0         0       3    male  22.0      1      0       1
1         1       1  female  38.0      1      0       1
2         1       3  female  26.0      0      0       0
3         1       1  female  35.0      1      0       1
4         0       3    male  35.0      0      0       0

In [34]:
titanic = titanic.drop(["SibSp", "Parch"], axis=1)

In [ ]:
# titanic.drop_duplicates()

In [35]:
titanic.head()

   Survived  Pclass     Sex   Age  family
0         0       3    male  22.0       1
1         1       1  female  38.0       1
2         1       3  female  26.0       0
3         1       1  female  35.0       1
4         0       3    male  35.0       0